NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A021F1024IM40.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG_S_CFGNS</name>
      <version>3</version>
      <description>SYSCFG_S_CFGNS Registers</description>
      <baseAddress>0x40078000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SYSCFG</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>SW0</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>SW1</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>SW2</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>SW3</name>
        <value>58</value>
      </interrupt>
      <registers>
        <register>
          <name>CFGNSTCALIB</name>
          <description>Configure to define the system tick for the M33.</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0x01004A37</resetValue>
          <resetMask>0x03FFFFFF</resetMask>
          <fields>
            <field>
              <name>TENMS</name>
              <description>Ten Milliseconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SKEW</name>
              <description>Skew</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOREF</name>
              <description>No Reference</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REF</name>
                  <description>Reference clock is implemented</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOREF</name>
                  <description>Reference clock is not implemented</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ROOTNSDATA0</name>
          <description>Generic data space for user to pass to root, e.g., address of struct in mem</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROOTNSDATA1</name>
          <description>Generic data space for user to pass to root, e.g., address of struct in mem</description>
          <addressOffset>0x604</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG_S</name>
      <version>3</version>
      <description>SYSCFG_S Registers</description>
      <baseAddress>0x4007C000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SYSCFG</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>SW0</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>SW1</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>SW2</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>SW3</name>
        <value>58</value>
      </interrupt>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>New BitField</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>Read to get system status.</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x33033F0F</resetMask>
          <fields>
            <field>
              <name>SW0</name>
              <description>Software Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW1</name>
              <description>Software Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW2</name>
              <description>Software Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW3</name>
              <description>Software Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIOC</name>
              <description>FPU Invalid Operation interrupt flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPDZC</name>
              <description>FPU Divide by zero interrupt flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPUFC</name>
              <description>FPU Underflow interrupt flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPOFC</name>
              <description>FPU Overflow interrupt flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIDC</name>
              <description>FPU Input denormal interrupt flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIXC</name>
              <description>FPU Inexact interrupt flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOST2SRWBUSERR</name>
              <description>HOST2SRWBUSERRIF Interrupt Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRW2HOSTBUSERR</name>
              <description>SRW2HOSTBUSERRIF Interrupt Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQRAMERR1B</name>
              <description>SEQRAM Error 1-bit Interrupt Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQRAMERR2B</name>
              <description>SEQRAM Error 2-bit Interrupt Flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCRAMERR1B</name>
              <description>FRCRAM Error 1-bit Interrupt Flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCRAMERR2B</name>
              <description>FRCRAM Error 2-bit Interrupt Flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>Write to enable interrupts.</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x33033F0F</resetMask>
          <fields>
            <field>
              <name>SW0</name>
              <description>Software Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW1</name>
              <description>Software Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW2</name>
              <description>Software Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW3</name>
              <description>Software Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIOC</name>
              <description>FPU Invalid Operation Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPDZC</name>
              <description>FPU Divide by zero Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPUFC</name>
              <description>FPU Underflow Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPOFC</name>
              <description>FPU Overflow Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIDC</name>
              <description>FPU Input denormal Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPIXC</name>
              <description>FPU Inexact Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOST2SRWBUSERR</name>
              <description>HOST2SRWBUSERRIEN Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRW2HOSTBUSERR</name>
              <description>SRW2HOSTBUSERRIEN Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQRAMERR1B</name>
              <description>SEQRAM Error 1-bit Interrupt Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQRAMERR2B</name>
              <description>SEQRAM Error 2-bit Interrupt Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCRAMERR1B</name>
              <description>FRCRAM Error 1-bit Interrupt Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCRAMERR2B</name>
              <description>FRCRAM Error 2-bit Interrupt Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPREVHW</name>
          <description>Read to get the hard-wired chip revision.</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000C01</resetValue>
          <resetMask>0xFF0FFFFF</resetMask>
          <fields>
            <field>
              <name>MAJOR</name>
              <description>Hardwired Chip Revision Major value  </description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAMILY</name>
              <description>Hardwired Chip Family value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Hardwired Chip Revision Minor value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPREV</name>
          <description>Read to get the chip revision programmed by feature configuration.</description>
          <addressOffset>0x018</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>MAJOR</name>
              <description>Chip Revision Major value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAMILY</name>
              <description>Chip Family value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Chip Revision Minor value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGSYSTIC</name>
          <description>Configure the source of the system tick for the M33.</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>SYSTICEXTCLKEN</name>
              <description>SysTick External Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Configure to provide general RAM configuration.</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000023</resetValue>
          <resetMask>0x00000023</resetMask>
          <fields>
            <field>
              <name>ADDRFAULTEN</name>
              <description>Invalid Address Bus Fault Response Enabl</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKDISFAULTEN</name>
              <description>Disabled Clkbus Bus Fault Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMECCERRFAULTEN</name>
              <description>Two bit ECC error bus fault response ena</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMEM0RETNCTRL</name>
          <description>Configure to provide general RAM retention configuration.</description>
          <addressOffset>0x208</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <fields>
            <field>
              <name>RAMRETNCTRL</name>
              <description>DMEM0 blockset retention control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLON</name>
                  <description>None of the RAM blocks powered down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK15</name>
                  <description>Power down RAM block 15 (address range 0x2003C000-0x20040000)</description>
                  <value>16384</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK14TO15</name>
                  <description>Power down RAM blocks 14 and above (address range 0x20038000-0x20040000)</description>
                  <value>24576</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK13TO15</name>
                  <description>Power down RAM blocks 13 and above (address range 0x20034000-0x20040000)</description>
                  <value>28672</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK12TO15</name>
                  <description>Power down RAM blocks 12 and above (address range 0x20030000-0x20040000)</description>
                  <value>30720</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK11TO15</name>
                  <description>Power down RAM blocks 11 and above (address range 0x2002C000-0x20040000)</description>
                  <value>31744</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK10TO15</name>
                  <description>Power down RAM blocks 10 and above (address range 0x20028000-0x20040000)</description>
                  <value>32256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK9TO15</name>
                  <description>Power down RAM blocks 9 and above (address range 0x20024000-0x20040000)</description>
                  <value>32512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK8TO15</name>
                  <description>Power down RAM blocks 8 and above (address range 0x20020000-0x20040000)</description>
                  <value>32640</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK7TO15</name>
                  <description>Power down RAM blocks 7 and above (address range 0x2001C000-0x20040000)</description>
                  <value>32704</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK6TO15</name>
                  <description>Power down RAM blocks 6 and above (address range 0x20018000-0x20040000)</description>
                  <value>32736</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK5TO15</name>
                  <description>Power down RAM blocks 5 and above (address range 0x20014000-0x20040000)</description>
                  <value>32752</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK4TO15</name>
                  <description>Power down RAM blocks 4 and above (address range 0x20010000-0x20040000)</description>
                  <value>32760</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK3TO15</name>
                  <description>Power down RAM blocks 3 and above (address range 0x2000C000-0x20040000)</description>
                  <value>32764</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK2TO15</name>
                  <description>Power down RAM blocks 2 and above (address range 0x20008000-0x20040000)</description>
                  <value>32766</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK1TO15</name>
                  <description>Power down RAM blocks 1 and above (address range 0x20004000-0x20040000)</description>
                  <value>32767</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
