NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A021F1024IM40.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYNTH_S</name>
      <version>2</version>
      <description>SYNTH_S Registers</description>
      <baseAddress>0xA8018000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SYNTH</name>
        <value>39</value>
      </interrupt>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IP Version</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable peripheral clock to this module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>No Description</description>
          <addressOffset>0x008</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x04014707</resetMask>
          <fields>
            <field>
              <name>INLOCK</name>
              <description>RF Synthesizer in Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IFFREQEN</name>
              <description>Synthesizer IF frequency enable status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>No Description</description>
          <addressOffset>0x00C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000061F</resetMask>
          <fields>
            <field>
              <name>SYNTHSTART</name>
              <description>Starts the RF synthesizer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SYNTHSTOP</name>
              <description>Stops the RF synthesizer</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLEIF</name>
              <description>Enable the synthesizer IF frequency</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLEIF</name>
              <description>Disable the synthesizer IF frequency</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CAPCALSTART</name>
              <description>Start VCO capacitor array calibration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>No Description</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xD9F70007</resetMask>
          <fields>
            <field>
              <name>LOCKTHRESHOLD</name>
              <description>Frequency synthesizer lock threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSMUX0</name>
              <description>PRS output mux 0 selector</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>PRS output 0 is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INLOCK</name>
                  <description>Synthesizer is in lock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_WINDOW</name>
                  <description>PLL Lock Window, sampled by PFD</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FPLL</name>
                  <description>Divided PLL clock</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCCMP_HI</name>
                  <description>VCO voltage high detected</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCO_AMPLITUDE_OK</name>
                  <description>Obsolete. Read returns 1.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCO_DET_OUT_D</name>
                  <description>Obsolete. Read returns 0.</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSMUX1</name>
              <description>PRS output mux 1 selector</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>PRS output 1 is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXINLOCK</name>
                  <description>Obsolete. read returns 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REF_IS_LEADING</name>
                  <description>Disabled. Read returns 0.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FPLL</name>
                  <description>Divided PLL clock</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCCMP_LOW</name>
                  <description>VCO voltage low detected</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MMD_PRESCALER_RESET_N</name>
                  <description>MMD prescaler reset, active low</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_SYNTH_DIV2</name>
                  <description>MMD next denom output, corresponding to the delta-sigma clock, divided by 2.</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCLKSYNTH</name>
              <description>Disable clk_synth</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable clk_synth</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable clk_synth</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVCLKSYNTH</name>
              <description>Invert clk_synth</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Do not invert clk_synth</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Invert clk_synth</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMDRSTNOVERRIDEEN</name>
              <description>Enable MMD reset override</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable MMD reset override</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable MMD reset override</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMDMANRSTN</name>
              <description>Manual MMD reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset MMD and DSM logic</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORESET</name>
                  <description>Allow MMD and DSM to run</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VCDACCTRL</name>
          <description>No Description</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>VCDACVAL</name>
              <description>Control voltage to VCO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCDACEN</name>
              <description>Enable VCDAC</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>VC DAC disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>VC DAC enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPFEN</name>
              <description>LPF Enable Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable LPF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable LPF</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPFQSEN</name>
              <description>LPF Quickstart Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable LPF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable LPF</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQ</name>
          <description>No Description</description>
          <addressOffset>0x034</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>FREQ</name>
              <description>RF Carrier Frequency.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFFREQ</name>
          <description>No Description</description>
          <addressOffset>0x038</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x001FFFFF</resetMask>
          <fields>
            <field>
              <name>IFFREQ</name>
              <description>IF used in receive mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOSIDE</name>
              <description>Configure LO in receive</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>The local oscillator (LO) is lower in frequency than the receive RF channel. In MODEM_MIXCTRL the ANAMIXMODE field must be set to NORMAL and DIGIQSWAPEN must be cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>The local oscillator (LO) is higher in frequency than the receive RF channel. In MODEM_MIXCTRL the ANAMIXMODE field must be set to CONJUGATE and DIGIQSWAPEN must be set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVCTRL</name>
          <description>No Description</description>
          <addressOffset>0x03C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>LODIVFREQCTRL</name>
              <description>Frequency division</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LODIV1</name>
                  <description>Divide LO frequency by 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV2</name>
                  <description>Divide LO frequency by 2.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV3</name>
                  <description>Divide LO frequency by 3.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV4</name>
                  <description>Divide LO frequency by 4.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV5</name>
                  <description>Divide LO frequency by 5.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV7</name>
                  <description>Divide LO frequency by 7.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV6</name>
                  <description>Divide LO frequency by 6.</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV8</name>
                  <description>Divide LO frequency by 8.</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV10</name>
                  <description>Divide LO frequency by 10.</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV14</name>
                  <description>Divide LO frequency by 14.</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV9</name>
                  <description>Divide LO frequency by 9.</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV12</name>
                  <description>Divide LO frequency by 12.</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV15</name>
                  <description>Divide LO frequency by 15.</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV16</name>
                  <description>Divide LO frequency by 16.</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV20</name>
                  <description>Divide LO frequency by 20.</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV18</name>
                  <description>Divide LO frequency by 18.</description>
                  <value>155</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV24</name>
                  <description>Divide LO frequency by 24.</description>
                  <value>156</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHCTRL</name>
          <description>No Description</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>CHNO</name>
              <description>Channel number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSP</name>
          <description>No Description</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>CHSP</name>
              <description>Channel spacing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALOFFSET</name>
          <description>No Description</description>
          <addressOffset>0x048</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <fields>
            <field>
              <name>CALOFFSET</name>
              <description>Carrier calibration offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VCOTUNING</name>
          <description>No Description</description>
          <addressOffset>0x04C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00008400</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>VCOTUNING</name>
              <description>VCO capacitor array calibration value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCAPSEL</name>
              <description>VCO varactor cap select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
